docs/loadtest-output.txt
Test run id: t4dr5_mg8j5bbn9n5a98cnp5jdk3kjaprk9_r34r
Phase started: Ramp up (index: 0, duration: 120s) 10:33:11(+0200)

--------------------------------------
Metrics for period to: 10:33:20(+0200) (width: 7.274s)
--------------------------------------

http.codes.200: ................................................................ 7
http.codes.401: ................................................................ 7
http.downloaded_bytes: ......................................................... 796
http.request_rate: ............................................................. 3/sec
http.requests: ................................................................. 14
http.response_time:
  min: ......................................................................... 17
  max: ......................................................................... 26
  mean: ........................................................................ 20.2
  median: ...................................................................... 19.1
  p95: ......................................................................... 24.8
  p99: ......................................................................... 24.8
http.response_time.2xx:
  min: ......................................................................... 17
  max: ......................................................................... 26
  mean: ........................................................................ 20.7
  median: ...................................................................... 19.1
  p95: ......................................................................... 24.8
  p99: ......................................................................... 24.8
http.response_time.4xx:
  min: ......................................................................... 19
  max: ......................................................................... 21
  mean: ........................................................................ 19.7
  median: ...................................................................... 19.9
  p95: ......................................................................... 19.9
  p99: ......................................................................... 19.9
http.responses: ................................................................ 14
vusers.created: ................................................................ 14
vusers.created_by_name.auth_providers: ......................................... 4
vusers.created_by_name.feed: ................................................... 2
vusers.created_by_name.geo_nearby_paris: ....................................... 4
vusers.created_by_name.geo_nearby_south: ....................................... 1
vusers.created_by_name.health: ................................................. 3


--------------------------------------
Metrics for period to: 10:33:30(+0200) (width: 9.407s)
--------------------------------------

http.codes.200: ................................................................ 15
http.codes.401: ................................................................ 25
http.downloaded_bytes: ......................................................... 1922
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 40
http.response_time:
  min: ......................................................................... 17
  max: ......................................................................... 22
  mean: ........................................................................ 19
  median: ...................................................................... 19.1
  p95: ......................................................................... 22
  p99: ......................................................................... 22
http.response_time.2xx:
  min: ......................................................................... 18
  max: ......................................................................... 22
  mean: ........................................................................ 19.3
  median: ...................................................................... 19.1
  p95: ......................................................................... 22
  p99: ......................................................................... 22
http.response_time.4xx:
  min: ......................................................................... 17
  max: ......................................................................... 22
  mean: ........................................................................ 18.8
  median: ...................................................................... 19.1
  p95: ......................................................................... 19.9
  p99: ......................................................................... 19.9
http.responses: ................................................................ 40
vusers.completed: .............................................................. 7
vusers.created: ................................................................ 40
vusers.created_by_name.auth_providers: ......................................... 11
vusers.created_by_name.feed: ................................................... 8
vusers.created_by_name.geo_nearby_paris: ....................................... 6
vusers.created_by_name.geo_nearby_south: ....................................... 11
vusers.created_by_name.health: ................................................. 4
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 8072.8
  max: ......................................................................... 15057.6
  mean: ........................................................................ 11071.1
  median: ...................................................................... 11971.2
  p95: ......................................................................... 11971.2
  p99: ......................................................................... 11971.2


--------------------------------------
Metrics for period to: 10:33:40(+0200) (width: 9.617s)
--------------------------------------

http.codes.200: ................................................................ 16
http.codes.401: ................................................................ 49
http.downloaded_bytes: ......................................................... 2698
http.request_rate: ............................................................. 8/sec
http.requests: ................................................................. 65
http.response_time:
  min: ......................................................................... 17
  max: ......................................................................... 29
  mean: ........................................................................ 19.8
  median: ...................................................................... 19.1
  p95: ......................................................................... 22.9
  p99: ......................................................................... 26.8
http.response_time.2xx:
  min: ......................................................................... 18
  max: ......................................................................... 29
  mean: ........................................................................ 21.8
  median: ...................................................................... 22
  p95: ......................................................................... 26.8
  p99: ......................................................................... 26.8
http.response_time.4xx:
  min: ......................................................................... 17
  max: ......................................................................... 26
  mean: ........................................................................ 19.1
  median: ...................................................................... 19.1
  p95: ......................................................................... 21.1
  p99: ......................................................................... 21.1
http.responses: ................................................................ 65
vusers.completed: .............................................................. 42
vusers.created: ................................................................ 65
vusers.created_by_name.auth_providers: ......................................... 8
vusers.created_by_name.feed: ................................................... 19
vusers.created_by_name.geo_nearby_paris: ....................................... 15
vusers.created_by_name.geo_nearby_south: ....................................... 15
vusers.created_by_name.health: ................................................. 8
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 8057.9
  max: ......................................................................... 20113
  mean: ........................................................................ 11688.9
  median: ...................................................................... 9999.2
  p95: ......................................................................... 15218.6
  p99: ......................................................................... 20136.3


--------------------------------------
Metrics for period to: 10:33:50(+0200) (width: 9.691s)
--------------------------------------

http.codes.200: ................................................................ 28
http.codes.401: ................................................................ 60
http.downloaded_bytes: ......................................................... 3980
http.request_rate: ............................................................. 11/sec
http.requests: ................................................................. 89
http.response_time:
  min: ......................................................................... 17
  max: ......................................................................... 27
  mean: ........................................................................ 19.4
  median: ...................................................................... 19.1
  p95: ......................................................................... 22
  p99: ......................................................................... 22.9
http.response_time.2xx:
  min: ......................................................................... 17
  max: ......................................................................... 23
  mean: ........................................................................ 20.1
  median: ...................................................................... 19.1
  p95: ......................................................................... 22.9
  p99: ......................................................................... 22.9
http.response_time.4xx:
  min: ......................................................................... 17
  max: ......................................................................... 27
  mean: ........................................................................ 19
  median: ...................................................................... 19.1
  p95: ......................................................................... 19.9
  p99: ......................................................................... 22
http.responses: ................................................................ 88
vusers.completed: .............................................................. 58
vusers.created: ................................................................ 89
vusers.created_by_name.auth_providers: ......................................... 19
vusers.created_by_name.feed: ................................................... 23
vusers.created_by_name.geo_nearby_paris: ....................................... 16
vusers.created_by_name.geo_nearby_south: ....................................... 21
vusers.created_by_name.health: ................................................. 10
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 8056.3
  max: ......................................................................... 20094.5
  mean: ........................................................................ 11207.2
  median: ...................................................................... 9999.2
  p95: ......................................................................... 20136.3
  p99: ......................................................................... 20136.3


--------------------------------------
Metrics for period to: 10:34:00(+0200) (width: 9.95s)
--------------------------------------

http.codes.200: ................................................................ 32
http.codes.401: ................................................................ 77
http.downloaded_bytes: ......................................................... 4724
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 109
http.response_time:
  min: ......................................................................... 16
  max: ......................................................................... 22
  mean: ........................................................................ 18.2
  median: ...................................................................... 16.9
  p95: ......................................................................... 21.1
  p99: ......................................................................... 21.1
http.response_time.2xx:
  min: ......................................................................... 16
  max: ......................................................................... 22
  mean: ........................................................................ 18.9
  median: ...................................................................... 19.9
  p95: ......................................................................... 21.1
  p99: ......................................................................... 21.1
http.response_time.4xx:
  min: ......................................................................... 16
  max: ......................................................................... 21
  mean: ........................................................................ 17.8
  median: ...................................................................... 16.9
  p95: ......................................................................... 21.1
  p99: ......................................................................... 21.1
http.responses: ................................................................ 109
vusers.completed: .............................................................. 77
vusers.created: ................................................................ 109
vusers.created_by_name.auth_providers: ......................................... 23
vusers.created_by_name.feed: ................................................... 29
vusers.created_by_name.geo_nearby_paris: ....................................... 27
vusers.created_by_name.geo_nearby_south: ....................................... 21
vusers.created_by_name.health: ................................................. 9
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 8057.2
  max: ......................................................................... 20093.8
  mean: ........................................................................ 11691.2
  median: ...................................................................... 9999.2
  p95: ......................................................................... 20136.3
  p99: ......................................................................... 20136.3


--------------------------------------
Metrics for period to: 10:34:10(+0200) (width: 9.971s)
--------------------------------------

http.codes.200: ................................................................ 51
http.codes.401: ................................................................ 82
http.downloaded_bytes: ......................................................... 6410
http.request_rate: ............................................................. 15/sec
http.requests: ................................................................. 133
http.response_time:
  min: ......................................................................... 16
  max: ......................................................................... 36
  mean: ........................................................................ 18.8
  median: ...................................................................... 18
  p95: ......................................................................... 22
  p99: ......................................................................... 23.8
http.response_time.2xx:
  min: ......................................................................... 17
  max: ......................................................................... 26
  mean: ........................................................................ 19.3
  median: ...................................................................... 19.1
  p95: ......................................................................... 23.8
  p99: ......................................................................... 23.8
http.response_time.4xx:
  min: ......................................................................... 16
  max: ......................................................................... 36
  mean: ........................................................................ 18.5
  median: ...................................................................... 18
  p95: ......................................................................... 21.1
  p99: ......................................................................... 22
http.responses: ................................................................ 133
vusers.completed: .............................................................. 112
vusers.created: ................................................................ 133
vusers.created_by_name.auth_providers: ......................................... 39
vusers.created_by_name.feed: ................................................... 24
vusers.created_by_name.geo_nearby_paris: ....................................... 31
vusers.created_by_name.geo_nearby_south: ....................................... 28
vusers.created_by_name.health: ................................................. 11
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 8057.4
  max: ......................................................................... 20080.7
  mean: ........................................................................ 11865.8
  median: ...................................................................... 11971.2
  p95: ......................................................................... 20136.3
  p99: ......................................................................... 20136.3